In [1]:
import pandas as pd

In [2]:
people = {
    'name': ['Michael Jordan', 'Kareem Abdul-Jabbar', 'LeBron James', 'Magic Johnson', 'Bill Russell', 'Larry Bird', 'Wilt Chamberlain',
             'Kobe Bryant', 'Tim Duncan', 'Shaquille O\'neal'],
    'team': ['Chicago Bulls', 'LA Lakers', 'Cleveland Cavaliers', 'LA Lakers', 'Boston Celtics', 'Boston Celtics', 'LA Lakers',
             'LA Lakers', 'SA Spurs', 'LA Lakers'],
    'rings': [6, 6, 3, 5, 11, 3, 2, 5, 5, 4]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df.shape

(10, 3)

In [5]:
df.head()

                  name                 team  rings
0       Michael Jordan        Chicago Bulls      6
1  Kareem Abdul-Jabbar            LA Lakers      6
2         LeBron James  Cleveland Cavaliers      3
3        Magic Johnson            LA Lakers      5
4         Bill Russell       Boston Celtics     11

In [6]:
df.loc[[0,1], ['team']]

            team
0  Chicago Bulls
1      LA Lakers

In [7]:
df.set_index('team')

                                    name  rings
team
Chicago Bulls             Michael Jordan      6
LA Lakers            Kareem Abdul-Jabbar      6
Cleveland Cavaliers         LeBron James      3
LA Lakers                  Magic Johnson      5
Boston Celtics              Bill Russell     11
Boston Celtics                Larry Bird      3
LA Lakers               Wilt Chamberlain      2
LA Lakers                    Kobe Bryant      5
SA Spurs                      Tim Duncan      5
LA Lakers               Shaquille O'neal      4

In [8]:
df['team'] == 'LA Lakers'

0    False
1     True
2    False
3     True
4    False
5    False
6     True
7     True
8    False
9     True
Name: team, dtype: bool

In [19]:
filt = (df['team'] == 'LA Lakers') | (df['name'] == 'Kobe Bryant')

In [27]:
df.loc[~filt, ['name', 'rings']]

             name  rings
0  Michael Jordan      6
2    LeBron James      3
4    Bill Russell     11
5      Larry Bird      3
8      Tim Duncan      5